auth-practice-backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$x5SdqaaxcszqLR9UZLYzA.O7EPqPbuQUKa6pWnYOZKX/Mr7DD1kti"], ["updated_at", "2019-04-21 20:53:58.999287"], ["id", 15]]
---
  def update
    user = User.find(params[:id])
    user.update(password: params[:user][:password])